Thermometer_Server/app/controllers/thermometers_controller.rb

  def index
    @thermometers = Thermometer.all
---
SELECT "thermometers".* FROM "thermometers"

  def create
    @thermometer = Thermometer.new(thermometer_params)
		puts @thermometer.temperature

    respond_to do |format|
      if @thermometer.save
---
INSERT INTO "thermometers" ("created_at", "name", "temperature", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-01-06 23:57:19.872486"], ["name", "sdf"], ["temperature", 90], ["updated_at", "2015-01-06 23:57:19.872486"]]

    def set_thermometer
      @thermometer = Thermometer.find(params[:id])
---
SELECT  "thermometers".* FROM "thermometers"  WHERE "thermometers"."id" = ? LIMIT 1  [["id", 1]]