app/controllers/contacts_controller.rb

  def create
    @contact = Contact.new(contact_params)

    respond_to do |format|
      if @contact.save
---
INSERT INTO "contacts" ("created_at", "department", "mobile_no", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2015-01-04 16:18:09.245137"], ["department", "housing"], ["mobile_no", "646-322-9846"], ["name", "orel"], ["updated_at", "2015-01-04 16:18:09.245137"]]