app/controllers/thermometers_controller.rb

  def index
    @thermometer = current_user.thermometers.order('created_at desc')
---
SELECT "thermometers".* FROM "thermometers"  WHERE "thermometers"."user_id" = ?  ORDER BY created_at desc  [["user_id", 14]]

  def show
		@thermometer = Thermometer.find(params[:id])
---
SELECT  "thermometers".* FROM "thermometers"  WHERE "thermometers"."id" = ? LIMIT 1  [["id", 1]]

  def create
		puts "*"*50
		puts params
    @thermometer = current_user.thermometers.new(thermometer_params)

    respond_to do |format|
      if @thermometer.save
---
INSERT INTO "thermometers" ("created_at", "name", "temperature", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2015-01-05 16:22:01.461507"], ["name", "efwfr"], ["temperature", 89.0], ["updated_at", "2015-01-05 16:22:01.461507"], ["user_id", 14]]

  def update
    respond_to do |format|
      if @thermometer.update(thermometer_params)
---
UPDATE "thermometers" SET "name" = ?, "temperature" = ?, "updated_at" = ? WHERE "thermometers"."id" = 5  [["name", "re"], ["temperature", 87.0], ["updated_at", "2015-01-04 15:01:23.680690"]]

  def destroy
    @thermometer.destroy
---
DELETE FROM "thermometers" WHERE "thermometers"."id" = ?  [["id", 53]]

    def set_thermometer
      @thermometer = Thermometer.find(params[:id])
---
SELECT  "thermometers".* FROM "thermometers"  WHERE "thermometers"."id" = ? LIMIT 1  [["id", 53]]